/* eslint-disable */

export default [
    {
        id: 0,
        hash: '해시메모',
        content: '해시메모 개인 프로젝트입니다.'
    },
    {
        id: 1,
        hash: '해시메모',
        content: '카카오톡 "나에게 보내기"를 모티브로 만들었으며, 간편하게 적은 메모를 추후에 모아볼 수 있도록 한 웹앱입니다'
    },
    {
        id: 2,
        hash: '사용법',
        content: '아래 text 입력창에서 메세지를 입력 후 "+" 혹은 엔터를 누를 시 추가됩니다.'
    },
    {
        id: 3,
        hash: '사용법',
        content: '메모 뒤에 "#" 하나를 달면, 제목처럼 지정이 가능하며, 추후에 모아 볼 수 있습니다.'
    },
    {
        id: 4,
        hash: '버그',
        content: '현재 모바일에선 shift Enter가 작동하지 않습니다.',
        // color: '' 컬러는 rgb 값으로, 그리고 컬러 세팅시 전 메모에 적용되니 적용시에는 모든 메모에 할 것
    },
    {
        id: 5,
        hash: '버그',
        content: 'hash에 "/" 입력시, 그리드 기능이 제대로 작동하지 않습니다.'
    },
    {
        id: 6,
        hash: '사용법',
        content: '오른쪽 위에 버튼으로 grid 모드로 변경할 수 있습니다. "#"를 붙여놓은 메모들을 모아 볼 수 있습니다.'
    },
    {
        id: 7,
        hash: '사용법',
        content: 'grid 클릭시 자세히 볼 수 있으며, 색상지정이 가능합니다.'
    },
    {
        id: 8,
        hash: '사용법',
        content: '현재 색상 지정은 자세히 보기에서만 가능하며, 추후 같은 메모 입력시, 다른 페이지에서도 같은 색상으로 입력됩니다.'
    },
    {
        id: 9,
        hash: '개발계획',
        content: '현재 로컬로 저장되고 있으나, pc <-> 모바일간 연계를 위해 db 연결 계획이 있습니다.'
    },
    {
        id: 10,
        hash: '사용법',
        content: '공지기능은 한가지만 지정 가능하며, 클릭시 해당 자세히보기로 이동합니다.'
    },
    {
        id: 11,
        hash: '개발계획',
        content: '검색기능 추가 계획이 있습니다.'
    },
    {
        id: 12,
        hash: undefined,
        content: '해시태그 없이도 이용 가능하며, 피드백 및 의견 환영합니다. 감사합니다.'
    },
]